Revit 2024 API
ParameterTypeId.FabricationPartMaterialThickness Property
 "Part Material Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationPartMaterialThickness { get; }
Visual Basic
Public Shared ReadOnly Property FabricationPartMaterialThickness As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationPartMaterialThickness {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace